OdDAI.AttributeKeyCollection.cleanBuffer(System.Byte*)
\details
Cleans the specified buffer and this collection of attribute keys.
This operation erases the stored keys and not just removes them from the collection.
\param buffer   [in] Buffer to clean.

OdDAI.AttributeKeyCollection.createBuffer(System.Byte**)
\details
Creates a buffer with data from this attribute key collection.
The created buffer has data with attribute keys, then data with attribute keys for inverse attributes.

OdDAI.AttributeKeyCollection.forEachKeyInDeclareOrder(std.function&lt;(OdDAI.AttributeKey!System.Runtime.CompilerServices.IsConst*)(OdDAI.AttributeKey!System.Runtime.CompilerServices.IsConst**)&gt;)
\details
Runs a specified function for each stored key in the collection, according to their order.
\param callBack   [in] Callback function to run for each key.

OdDAI.AttributeKeyCollection.getDataBlockSize
\details
Gets a data block size stored by this collection.
\returns number of bytes that are needed for storing attribute keys.

OdDAI.AttributeKeyCollection.getCount(System.Boolean)
\details
Gets a number of attribute keys stored in this collection.
\param withInverse   [in] Indicates whether to include into count stored keys of inverse attributes.
\returns number of attribute keys stored in this collection.

OdDAI.AttributeKeyCollection.findByAttribute(OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Find appropriate dest attribute by src attribute provided when resolving complex entity instances
after rearing of partial complexes set.

OdDAI.AttributeKeyCollection.getByNameInverse(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Gets an attribute key of an inverse attribute by the specified key name.
\param attribute   [in] Attribute key name for which to get an attribute key.
\returns Pointer to a found key if successful; otherwise the method returns nullptr.

OdDAI.AttributeKeyCollection.getByName(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Gets an attribute key of an attribute by the specified key name.
\param attribute   [in] Attribute key name for which to get an attribute key.
\returns Pointer to a found key if successful; otherwise the method returns nullptr.

OdDAI.AttributeKeyCollection.getByAttributeInverse(OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Gets an attribute key by the specified inverse attribute.
\param attribute   [in] Inverse attribute for which to get an attribute key.
\returns Pointer to a found key if successful; otherwise the method returns nullptr.

OdDAI.AttributeKeyCollection.getByAttribute(OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Gets an attribute key by the specified attribute.
\param attribute   [in] Attribute for which to get an attribute key.
\returns Pointer to a found key if successful; otherwise the method returns nullptr.

OdDAI.AttributeKeyCollection
\details
This class is a collection of AttributeKey objects.